In [1]:
import pandas as pd
import os

In [2]:
csv_files = ['sentiments_1.csv','sentiments_2.csv','sentiments_3.csv','sentiments_4.csv']

dataframes = [pd.read_csv(file) for file in csv_files]

sentiment_df = pd.concat(dataframes, ignore_index=True)

In [3]:
sentiment_df.columns

Index(['title', 'comments', 'sentiments'], dtype='object')

In [19]:
sentiment_df[sentiment_df['title'] == 'All Superheroes Must Die']

                        title                          comments sentiments
99   All Superheroes Must Die   I'll be looking forward to this   Positive
100  All Superheroes Must Die       wow another kickass movie\n   Positive
101  All Superheroes Must Die  YAAAAAAY\nfirst comment\nYAAAAAY   Negative

In [58]:
# filtered_df = sentiment_df.groupby('sentiments')['title'].apply(lambda x: x.str.contains('13 Hours: The Secret Soldiers of Benghazi').sum())
# filtered_df

In [4]:
grouped = sentiment_df.groupby(['title', 'sentiments']).size()
count_df = grouped.unstack(fill_value=0)

In [5]:
count_df.columns = ['negative', 'positive']

In [6]:
new_df = count_df.reset_index()
new_df

                                          title  negative  positive
0                                       #Horror        19         9
1                         10 Days in a Madhouse         3         0
2                                     12 Strong        25        26
3     13 Hours: The Secret Soldiers of Benghazi         1         0
4                                       13 Sins         6         6
...                                         ...       ...       ...
1713                                   Zootopia         4         0
1714                                       Zulu         1         0
1715                            jackass forever      3749      3234
1716                 xXx: Return of Xander Cage        32        14
1717                        Épouse-moi mon pote         6         5

[1718 rows x 3 columns]

In [17]:
movie_df = pd.read_csv('movies.csv').drop('index', axis=1)
movie_df.head()

,date,title,production budget,domestric budget,worldwide gross
0,"Jan 4, 2013",Texas Chainsaw 3D,"$20,000,000","$34,341,945","$47,666,013"
1,"Jan 4, 2013",Promised Land,"$15,000,000","$7,597,898","$12,394,562"
2,"Jan 4, 2013",All Superheroes Must Die,"$20,000",$0,$0
3,"Jan 8, 2013",Yi dai zong shi,"$38,600,000","$6,594,959","$57,986,660"
4,"Jan 9, 2013",Gangster Squad,"$60,000,000","$46,000,903","$104,100,903"

In [18]:
merged_df = pd.merge(movie_df, new_df, on='title', how='left')
merged_df.fillna({'negative':0}, inplace=True)
merged_df.fillna({'positive':0}, inplace=True)
merged_df.head()

,date,title,production budget,domestric budget,worldwide gross,negative,positive
0,"Jan 4, 2013",Texas Chainsaw 3D,"$20,000,000","$34,341,945","$47,666,013",35.0,11.0
1,"Jan 4, 2013",Promised Land,"$15,000,000","$7,597,898","$12,394,562",34.0,19.0
2,"Jan 4, 2013",All Superheroes Must Die,"$20,000",$0,$0,1.0,2.0
3,"Jan 8, 2013",Yi dai zong shi,"$38,600,000","$6,594,959","$57,986,660",0.0,0.0
4,"Jan 9, 2013",Gangster Squad,"$60,000,000","$46,000,903","$104,100,903",44.0,27.0

In [ ]:
merged_df.to_csv('sentiments_movies.csv')